<template>
    <div class="score clearfix">
        <h2 class="score-title">
            分值: 
            <span class="score-value">123</span>
        </h2>
        <div class="score-container first">
          <div class="score-name">范德萨发货少得可怜返回来看</div>
          <div class="score-text" v-html="sourceContent"></div>
        </div>
        <div class="score-container last" >
          <div class="score-name"></div>
          <div class="score-text" v-html="targetContent"></div>
        </div>
    </div>
</template>
<script>
export default {
  data() {
    return {
      sourceContent: '',
      targetContent: ''
    }
  },
  mounted() {
    this.$nextTick(_ => {
      this.getData()
    })
  },
  methods: {
    getData() {
      const response = {
        'code': 1,
        'data': {
          'item': {
            'targetDocContent': '1999年4月29日第九届全国人民代表大会常务委员会第九次会议通过\n\n1999年4月29日中华人民共和国主席令第十六号公布\n\n自1999年10月1日起施行\n\n第一章　总  则\n\n　　第一条　为了防止和纠正违法的或者不当的具体行政行为，保护公民、法人和其他组织的合法权益，保障和监督行政机关依法行使职权，根据宪法，制定本法。\n\n　　第二条　公民、法人或者其他组织认为具体行政行为侵犯其合法权益，向行政机关提出行政复议申请，行政机关受理行政复议申请、作出行政复议决定，适用本法。\n\n　　第三条　依照本法履行行政复议职责的行政机关是行政复议机关。行政复议机关负责法制工作的机构具体办理行政复议事项，履行下列职责：\n\n　　（一）受理行政复议申请；\n\n　　（二）向有关组织和人员调查取证，查阅文件和资料；\n\n　　（三）审查申请行政复议的具体行政行为是否合法与适当，拟订行政复议决定；\n\n　　（四）处理或者转送对本法第七条所列有关规定的审查申请；\n\n　　（五）对行政机关违反本法规定的行为依照规定的权限和程序提出处理建议；\n\n　　（六）办理因不服行政复议决定提起行政诉讼的应诉事项；\n\n　　（七）法律、法规规定的其他职责。\n\n　　第四条　行政复议机关履行行政复议职责，应当遵循合法、公正、公开、及时、便民的原则，坚持有错必纠，保障法律、法规的正确实施。\n\n　　第五条　公民、法人或者其他组织对行政复议决定不服的，可以依照行政诉讼法的规定向人民法院提起行政诉讼，但是法律规定行政复议决定为最终裁决的除外。\n\n第二章　行政复议范围\n\n　　第六条　有下列情形之一的，公民、法人或者其他组织可以依照本法申请行政复议：\n\n　　（一）对行政机关作出的警告、罚款、没收违法所得、没收非法财物、责令停产停业、暂扣或者吊销许可证、暂扣或者吊销执照、行政拘留等行政处罚决定不服的；\n\n　　（二）对行政机关作出的限制人身自由或者查封、扣押、冻结财产等行政强制措施决定不服的；\n\n　　（三）对行政机关作出的有关许可证、执照、资质证、资格证等证书变更、中止、撤销的决定不服的；\n\n　　（四）对行政机关作出的关于确认土地、矿藏、水流、森林、山岭、草原、荒地、滩涂、海域等自然资源的所有权或者使用权的决定不服的；\n\n　　（五）认为行政机关侵犯合法的经营自主权的；\n\n　　（六）认为行政机关变更或者废止农业承包合同，侵犯其合法权益的；\n\n　　（七）认为行政机关违法集资、征收财物、摊派费用或者违法要求履行其他义务的；\n\n　　（八）认为符合法定条件，申请行政机关颁发许可证、执照、资质证、资格证等证书，或者申请行政机关审批、登记有关事项，行政机关没有依法办理的；\n\n　　（九）申请行政机关履行保护人身权利、财产权利、受教育权利的法定职责，行政机关没有依法履行的；\n\n　　（十）申请行政机关依法发放抚恤金、社会保险金或者最低生活保障费，行政机关没有依法发放的；\n\n　　（十一）认为行政机关的其他具体行政行为侵犯其合法权益的。\n\n　　第七条　公民、法人或者其他组织认为行政机关的具体行政行为所依据的下列规定不合法，在对具体行政行为申请行政复议时，可以一并向行政复议机关提出对该规定的审查申请：\n\n　　（一）国务院部门的规定；\n\n　　（二）县级以上地方各级人民政府及其工作部门的规定；\n\n　　（三）乡、镇人民政府的规定。\n\n　　前款所列规定不含国务院部、委员会规章和地方人民政府规章。规章的审查依照法律、行政法规办理。\n\n　　第八条　不服行政机关作出的行政处分或者其他人事处理决定的，依照有关法律、行政法规的规定提出申诉。\n\n　　不服行政机关对民事纠纷作出的调解或者其他处理，依法申请仲裁或者向人民法院提起诉讼。\n\n第三章　行政复议申请\n\n　　第九条　公民、法人或者其他组织认为具体行政行为侵犯其合法权益的，可以自知道该具体行政行为之日起六十日内提出行政复议申请；但是法律规定的申请期限超过六十日的除外。\n\n　　因不可抗力或者其他正当理由耽误法定申请期限的，申请期限自障碍消除之日起继续计算。\n\n　　第十条　依照本法申请行政复议的公民、法人或者其他组织是申请人。\n\n　　有权申请行政复议的公民死亡的，其近亲属可以申请行政复议。有权申请行政复议的公民为无民事行为能力人或者限制民事行为能力人的，其法定代理人可以代为申请行政复议。有权申请行政复议的法人或者其他组织终止的，承受其权利的法人或者其他组织可以申请行政复议。\n\n　　同申请行政复议的具体行政行为有利害关系的其他公民、法人或者其他组织，可以作为第三人参加行政复议。\n\n　　公民、法人或者其他组织对行政机关的具体行政行为不服申请行政复议的，作出具体行政行为的行政机关是被申请人。\n\n　　申请人、第三人可以委托代理人代为参加行政复议。\n\n　　第十一条　申请人申请行政复议，可以书面申请，也可以口头申请；口头申请的，行政复议机关应当当场记录申请人的基本情况、行政复议请求、申请行政复议的主要事实、理由和时间。\n\n　　第十二条　对县级以上地方各级人民政府工作部门的具体行政行为不服的，由申请人选择，可以向该部门的本级人民政府申请行政复议，也可以向上一级主管部门申请行政复议。\n\n　　对海关、金融、国税、外汇管理等实行垂直领导的行政机关和国家安全机关的具体行政行为不服的，向上一级主管部门申请行政复议。\n\n　　第十三条　对地方各级人民政府的具体行政行为不服的，向上一级地方人民政府申请行政复议。\n\n　　对省、自治区人民政府依法设立的派出机关所属的县级地方人民政府的具体行政行为不服的，向该派出机关申请行政复议。\n\n　　第十四条　对国务院部门或者省、自治区、直辖市人民政府的具体行政行为不服的，向作出该具体行政行为的国务院部门或者省、自治区、直辖市人民政府申请行政复议。对行政复议决定不服的，可以向人民法院提起行政诉讼；也可以向国务院申请裁决，国务院依照本法的规定作出最终裁决。\n\n　　第十五条　对本法第十二条、第十三条、第十四条规定以外的其他行政机关、组织的具体行政行为不服的，按照下列规定申请行政复议：\n\n　　（一）对县级以上地方人民政府依法设立的派出机关的具体行政行为不服的，向设立该派出机关的人民政府申请行政复议；\n\n　　（二）对政府工作部门依法设立的派出机构依照法律、法规或者规章规定，以自己的名义作出的具体行政行为不服的，向设立该派出机构的部门或者该部门的本级地方人民政府申请行政复议；\n\n　　（三）对法律、法规授权的组织的具体行政行为不服的，分别向直接管理该组织的地方人民政府、地方人民政府工作部门或者国务院部门申请行政复议；\n\n　　（四）对两个或者两个以上行政机关以共同的名义作出的具体行政行为不服的，向其共同上一级行政机关申请行政复议；\n\n　　（五）对被撤销的行政机关在撤销前所作出的具体行政行为不服的，向继续行使其职权的行政机关的上一级行政机关申请行政复议。\n\n　　有前款所列情形之一的，申请人也可以向具体行政行为发生地的县级地方人民政府提出行政复议申请，由接受申请的县级地方人民政府依照本法第十八条的规定办理。\n\n　　第十六条　公民、法人或者其他组织申请行政复议，行政复议机关已经依法受理的，或者法律、法规规定应当先向行政复议机关申请行政复议、对行政复议决定不服再向人民法院提起行政诉讼的，在法定行政复议期限内不得向人民法院提起行政诉讼。\n\n　　公民、法人或者其他组织向人民法院提起行政诉讼，人民法院已经依法受理的，不得申请行政复议。\n\n第四章　行政复议受理\n\n　　第十七条　行政复议机关收到行政复议申请后，应当在五日内进行审查，对不符合本法规定的行政复议申请，决定不予受理，并书面告知申请人；对符合本法规定，但是不属于本机关受理的行政复议申请，应当告知申请人向有关行政复议机关提出。\n\n　　除前款规定外，行政复议申请自行政复议机关负责法制工作的机构收到之日起即为受理。\n\n　　第十八条　依照本法第十五条第二款的规定接受行政复议申请的县级地方人民政府，对依照本法第十五条第一款的规定属于其他行政复议机关受理的行政复议申请，应当自接到该行政复议申请之日起七日内，转送有关行政复议机关，并告知申请人。接受转送的行政复议机关应当依照本法第十七条的规定办理。\n\n　　第十九条　法律、法规规定应当先向行政复议机关申请行政复议、对行政复议决定不服再向人民法院提起行政诉讼的，行政复议机关决定不予受理或者受理后超过行政复议期限不作答复的，公民、法人或者其他组织可以自收到不予受理决定书之日起或者行政复议期满之日起十五日内，依法向人民法院提起行政诉讼。\n\n　　第二十条　公民、法人或者其他组织依法提出行政复议申请，行政复议机关无正当理由不予受理的，上级行政机关应当责令其受理；必要时，上级行政机关也可以直接受理。\n\n　　第二十一条　行政复议期间具体行政行为不停止执行；但是，有下列情形之一的，可以停止执行：\n\n　　（一）被申请人认为需要停止执行的；\n\n　　（二）行政复议机关认为需要停止执行的；\n\n　　（三）申请人申请停止执行，行政复议机关认为其要求合理，决定停止执行的；\n\n　　（四）法律规定停止执行的。\n\n第五章　行政复议决定\n\n　　第二十二条　行政复议原则上采取书面审查的办法，但是申请人提出要求或者行政复议机关负责法制工作的机构认为有必要时，可以向有关组织和人员调查情况，听取申请人、被申请人和第三人的意见。\n\n　　第二十三条　行政复议机关负责法制工作的机构应当自行政复议申请受理之日起七日内，将行政复议申请书副本或者行政复议申请笔录复印件发送被申请人。被申请人应当自收到申请书副本或者申请笔录复印件之日起十日内，提出书面答复，并提交当初作出具体行政行为的证据、依据和其他有关材料。\n\n　　申请人、第三人可以查阅被申请人提出的书面答复、作出具体行政行为的证据、依据和其他有关材料，除涉及国家秘密、商业秘密或者个人隐私外，行政复议机关不得拒绝。\n\n　　第二十四条　在行政复议过程中，被申请人不得自行向申请人和其他有关组织或者个人收集证据。\n\n　　第二十五条　行政复议决定作出前，申请人要求撤回行政复议申请的，经说明理由，可以撤回；撤回行政复议申请的，行政复议终止。\n\n　　第二十六条　申请人在申请行政复议时，一并提出对本法第七条所列有关规定的审查申请的，行政复议机关对该规定有权处理的，应当在三十日内依法处理；无权处理的，应当在七日内按照法定程序转送有权处理的行政机关依法处理，有权处理的行政机关应当在六十日内依法处理。处理期间，中止对具体行政行为的审查。\n\n　　第二十七条　行政复议机关在对被申请人作出的具体行政行为进行审查时，认为其依据不合法，本机关有权处理的，应当在三十日内依法处理；无权处理的，应当在七日内按照法定程序转送有权处理的国家机关依法处理。处理期间，中止对具体行政行为的审查。\n\n　　第二十八条　行政复议机关负责法制工作的机构应当对被申请人作出的具体行政行为进行审查，提出意见，经行政复议机关的负责人同意或者集体讨论通过后，按照下列规定作出行政复议决定：\n\n　　（一）具体行政行为认定事实清楚，证据确凿，适用依据正确，程序合法，内容适当的，决定维持；\n\n　　（二）被申请人不履行法定职责的，决定其在一定期限内履行；\n\n　　（三）具体行政行为有下列情形之一的，决定撤销、变更或者确认该具体行政行为违法；决定撤销或者确认该具体行政行为违法的，可以责令被申请人在一定期限内重新作出具体行政行为：\n\n　　1．主要事实不清、证据不足的；\n\n　　2．适用依据错误的；\n\n　　3．违反法定程序的；\n\n　　4．超越或者滥用职权的；\n\n　　5．具体行政行为明显不当的。\n\n　　（四）被申请人不按照本法第二十三条的规定提出书面答复、提交当初作出具体行政行为的证据、依据和其他有关材料的，视为该具体行政行为没有证据、依据，决定撤销该具体行政行为。\n\n　　行政复议机关责令被申请人重新作出具体行政行为的，被申请人不得以同一的事实和理由作出与原具体行政行为相同或者基本相同的具体行政行为。\n\n　　第二十九条　申请人在申请行政复议时可以一并提出行政赔偿请求，行政复议机关对符合国家赔偿法的有关规定应当给予赔偿的，在决定撤销、变更具体行政行为或者确认具体行政行为违法时，应当同时决定被申请人依法给予赔偿。\n\n　　申请人在申请行政复议时没有提出行政赔偿请求的，行政复议机关在依法决定撤销或者变更罚款，撤销违法集资、没收财物、征收财物、摊派费用以及对财产的查封、扣押、冻结等具体行政行为时，应当同时责令被申请人返还财产，解除对财产的查封、扣押、冻结措施，或者赔偿相应的价款。\n\n　　第三十条　公民、法人或者其他组织认为行政机关的具体行政行为侵犯其已经依法取得的土地、矿藏、水流、森林、山岭、草原、荒地、滩涂、海域等自然资源的所有权或者使用权的，应当先申请行政复议；对行政复议决定不服的，可以依法向人民法院提起行政诉讼。\n\n　　根据国务院或者省、自治区、直辖市人民政府对行政区划的勘定、调整或者征用土地的决定，省、自治区、直辖市人民政府确认土地、矿藏、水流、森林、山岭、草原、荒地、滩涂、海域等自然资源的所有权或者使用权的行政复议决定为最终裁决。\n\n　　第三十一条　行政复议机关应当自受理申请之日起六十日内作出行政复议决定；但是法律规定的行政复议期限少于六十日的除外。情况复杂，不能在规定期限内作出行政复议决定的，经行政复议机关的负责人批准，可以适当延长，并告知申请人和被申请人；但是延长期限最多不超过三十日。\n\n　　行政复议机关作出行政复议决定，应当制作行政复议决定书，并加盖印章。\n\n　　行政复议决定书一经送达，即发生法律效力。\n\n　　第三十二条　被申请人应当履行行政复议决定。\n\n　　被申请人不履行或者无正当理由拖延履行行政复议决定的，行政复议机关或者有关上级行政机关应当责令其限期履行。\n\n　　第三十三条　申请人逾期不起诉又不履行行政复议决定的，或者不履行最终裁决的行政复议决定的，按照下列规定分别处理：\n\n　　（一）维持具体行政行为的行政复议决定，由作出具体行政行为的行政机关依法强制执行，或者申请人民法院强制执行；\n\n　　（二）变更具体行政行为的行政复议决定，由行政复议机关依法强制执行，或者申请人民法院强制执行。\n\n第六章　法律责任\n\n　　第三十四条　行政复议机关违反本法规定，无正当理由不予受理依法提出的行政复议申请或者不按照规定转送行政复议申请的，或者在法定期限内不作出行政复议决定的，对直接负责的主管人员和其他直接责任人员依法给予警告、记过、记大过的行政处分；经责令受理仍不受理或者不按照规定转送行政复议申请，造成严重后果的，依法给予降级、撤职、开除的行政处分。\n\n　　第三十五条　行政复议机关工作人员在行政复议活动中，徇私舞弊或者有其他渎职、失职行为的，依法给予警告、记过、记大过的行政处分；情节严重的，依法给予降级、撤职、开除的行政处分；构成犯罪的，依法追究刑事责任。\n\n　　第三十六条　被申请人违反本法规定，不提出书面答复或者不提交作出具体行政行为的证据、依据和其他有关材料，或者阻挠、变相阻挠公民、法人或者其他组织依法申请行政复议的，对直接负责的主管人员和其他直接责任人员依法给予警告、记过、记大过的行政处分；进行报复陷害的，依法给予降级、撤职、开除的行政处分；构成犯罪的，依法追究刑事责任。\n\n　　第三十七条　被申请人不履行或者无正当理由拖延履行行政复议决定的，对直接负责的主管人员和其他直接责任人员依法给予警告、记过、记大过的行政处分；经责令履行仍拒不履行的，依法给予降级、撤职、开除的行政处分。\n\n　　第三十八条　行政复议机关负责法制工作的机构发现有无正当理由不予受理行政复议申请、不按照规定期限作出行政复议决定、徇私舞弊、对申请人打击报复或者不履行行政复议决定等情形的，应当向有关行政机关提出建议，有关行政机关应当依照本法和有关法律、行政法规的规定作出处理。\n\n第七章　附  则\n\n　　第三十九条　行政复议机关受理行政复议申请，不得向申请人收取任何费用。行政复议活动所需经费，应当列入本机关的行政经费，由本级财政予以保障。\n\n　　第四十条　行政复议期间的计算和行政复议文书的送达，依照民事诉讼法关于期间、送达的规定执行。\n\n　　本法关于行政复议期间有关“五日”、“七日”的规定是指工作日，不含节假日。\n\n　　第四十一条　外国人、无国籍人、外国组织在中华人民共和国境内申请行政复议，适用本法。\n\n　　第四十二条　本法施行前公布的法律有关行政复议的规定与本法的规定不一致的，以本法的规定为准。\n\n　　第四十三条　本法自1999年10月1日起施行。1990年12月24日国务院发布、1994年10月9日国务院修订发布的《行政复议条例》同时废止。',
            'sourceDocContent': '1999年4月29日第九届全国人民代表大会常务委员会第九次会议通过docx\n\n1999年4月29日中华人民共和国主席令第十六号公布\n\n自1999年10月1日起施行\n\n第一章　总  则\n\t第六条 国家制定并不断完善国家安全战略，全面评估国际、国内安全形势，明确国家安全战略的指导方针、中长期目标、重点领域的国家安全政策、工作任务和措施。\n\t第十三条 国家机关工作人员在国家安全工作和涉及国家安全活动中，滥用职权、玩忽职守、徇私舞弊的，依法追究法律责任。\n\t任何个人和组织违反本法和有关法律，不履行维护国家安全义务或者从事危害国家安全活动的，依法追究法律责任。\n\t第十四条 每年4月15日为全民国家安全教育日。\n\t第五十九条 国家建立国家安全审查和监管的制度和机制，对影响或者可能影响国家安全的外商投资、特定物项和关键技术、网络信息技术产品和服务、涉及国家安全事项的建设项目，以及其他重大事项和活动，进行国家安全审查，有效预防和化解国家安全风险。\n\t第六十条 中央国家机关各部门依照法律、行政法规行使国家安全审查职责，依法作出国家安全审查决定或者提出安全审查意见并监督执行。\n\t第六十一条 省、自治区、直辖市依法负责本行政区域内有关国家安全审查和监管工作。　　\n第二十九条　申请人在申请行政复议时可以一并提出行政赔偿请求，行政复议机关对符合国家赔偿法的有关规定应当给予赔偿的，在决定撤销、变更具体行政行为或者确认具体行政行为违法时，应当同时决定被申请人依法给予赔偿。\n\n　　申请人在申请行政复议时没有提出行政赔偿请求的，行政复议机关在依法决定撤销或者变更罚款，撤销违法集资、没收财物、征收财物、摊派费用以及对财产的查封、扣押、冻结等具体行政行为时，应当同时责令被申请人返还财产，解除对财产的查封、扣押、冻结措施，或者赔偿相应的价款。\n\n　　第三十条　公民、法人或者其他组织认为行政机关的具体行政行为侵犯其已经依法取得的土地、矿藏、水流、森林、山岭、草原、荒地、滩涂、海域等自然资源的所有权或者使用权的，应当先申请行政复议；对行政复议决定不服的，可以依法向人民法院提起行政诉讼。\n\n　　根据国务院或者省、自治区、直辖市人民政府对行政区划的勘定、调整或者征用土地的决定，省、自治区、直辖市人民政府确认土地、矿藏、水流、森林、山岭、草原、荒地、滩涂、海域等自然资源的所有权或者使用权的行政复议决定为最终裁决。\n\n　　第三十一条　行政复议机关应当自受理申请之日起六十日内作出行政复议决定；但是法律规定的行政复议期限少于六十日的除外。情况复杂，不能在规定期限内作出行政复议决定的，经行政复议机关的负责人批准，可以适当延长，并告知申请人和被申请人；但是延长期限最多不超过三十日。\n\n　　行政复议机关作出行政复议决定，应当制作行政复议决定书，并加盖印章。\n\n　　行政复议决定书一经送达，即发生法律效力。\n\n　　第三十二条　被申请人应当履行行政复议决定。\n\n　　被申请人不履行或者无正当理由拖延履行行政复议决定的，行政复议机关或者有关上级行政机关应当责令其限期履行。\n\n　　第三十三条　申请人逾期不起诉又不履行行政复议决定的，或者不履行最终裁决的行政复议决定的，按照下列规定分别处理：\n\n　　（一）维持具体行政行为的行政复议决定，由作出具体行政行为的行政机关依法强制执行，或者申请人民法院强制执行；\n\n　　（二）变更具体行政行为的行政复议决定，由行政复议机关依法强制执行，或者申请人民法院强制执行。\n\n第七章　附  则\n\n　　第三十九条　行政复议机关受理行政复议申请，不得向申请人收取任何费用。行政复议活动所需经费，应当列入本机关的行政经费，由本级财政予以保障。\n\n　　第四十条　行政复议期间的计算和行政复议文书的送达，依照民事诉讼法关于期间、送达的规定执行。\n\n　　本法关于行政复议期间有关“五日”、“七日”的规定是指工作日，不含节假日。\n\n　　第四十一条　外国人、无国籍人、外国组织在中华人民共和国境内申请行政复议，适用本法。\n\n　　第四十二条　本法施行前公布的法律有关行政复议的规定与本法的规定不一致的，以本法的规定为准。\n\n　　第四十三条　本法自1999年10月1日起施行。1990年12月24日国务院发布、1994年10月9日国务院修订发布的《行政复议条例》同时废止。\n\t任何个人和组织不得有危害国家安全的行为，不得向危害国家安全的个人或者组织提供任何资助或者协助。\n第七十八条 机关、人民团体、企业事业组织和其他社会组织应当对本单位的人员进行维护国家安全的教育，动员、组织本单位的人员防范、制止危害国家安全的行为。\n第七十九条 企业事业组织根据国家安全工作的要求，应当配合有关部门采取相关安全措施。\n第八十条 公民和组织支持、协助国家安全工作的行为受法律保护。\n因支持、协助国家安全工作，本人或者其近亲属的人身安全面临危险的，可以向公安机关、国家安全机关请求予以保护。公安机关、国家安全机关应当会同有关部门依法采取保护措施。\n第八十一条 公民和组织因支持、协助国家安全工作导致财产损失的，按照国家有关规定给予补偿；造成人身伤害或者死亡的，按照国家有关规定给予抚恤优待。\n第八十二条 公民和组织对国家安全工作有向国家机关提出批评建议的权利，对国家机关及其工作人员在国家安全工作中的违法失职行为有提出申诉、控告和检举的权利。\n第八十三条 在国家安全工作中，需要采取限制公民权利和自由的特别措施时，应当依法进行，并以维护国家安全的实际需要为限度。\n',
            'checkResult': [
              {
                'OUT_SOURCE_START': 0,
                'OUT_SOURCE_CONTENT': '1999年4月29日第九届全国人民代表大会常务委员会第九次会议通过docx\n',
                'SOURCE_ID': 441,
                'SCORE': 0.96076894,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 34,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 38,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 0,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '1999年4月29日第九届全国人民代表大会常务委员会第九次会议通过\n'
              },
              {
                'OUT_SOURCE_START': 67,
                'OUT_SOURCE_CONTENT': '自1999年10月1日起施行\n',
                'SOURCE_ID': 441,
                'SCORE': 0.7126967,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 6831,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 82,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 6806,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '　　第四十三条　本法自1999年10月1日起施行。'
              },
              {
                'OUT_SOURCE_START': 529,
                'OUT_SOURCE_CONTENT': '第二十九条　申请人在申请行政复议时可以一并提出行政赔偿请求，行政复议机关对符合国家赔偿法的有关规定应当给予赔偿的，在决定撤销、变更具体行政行为或者确认具体行政行为违法时，应当同时决定被申请人依法给予赔偿。',
                'SOURCE_ID': 441,
                'SCORE': 0.99365073,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 5047,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 631,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 4943,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '　　第二十九条　申请人在申请行政复议时可以一并提出行政赔偿请求，行政复议机关对符合国家赔偿法的有关规定应当给予赔偿的，在决定撤销、变更具体行政行为或者确认具体行政行为违法时，应当同时决定被申请人依法给予赔偿。'
              },
              {
                'OUT_SOURCE_START': 766,
                'OUT_SOURCE_CONTENT': '　　第三十条　公民、法人或者其他组织认为行政机关的具体行政行为侵犯其已经依法取得的土地、矿藏、水流、森林、山岭、草原、荒地、滩涂、海域等自然资源的所有权或者使用权的，应当先申请行政复议；',
                'SOURCE_ID': 441,
                'SCORE': 0.7116232,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 935,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 859,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 871,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '　　（四）对行政机关作出的关于确认土地、矿藏、水流、森林、山岭、草原、荒地、滩涂、海域等自然资源的所有权或者使用权的决定不服的；'
              },
              {
                'OUT_SOURCE_START': 859,
                'OUT_SOURCE_CONTENT': '对行政复议决定不服的，可以依法向人民法院提起行政诉讼。',
                'SOURCE_ID': 441,
                'SCORE': 0.9574271,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 2405,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 886,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 2380,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '对行政复议决定不服的，可以向人民法院提起行政诉讼；'
              },
              {
                'OUT_SOURCE_START': 1038,
                'OUT_SOURCE_CONTENT': '但是法律规定的行政复议期限少于六十日的除外。',
                'SOURCE_ID': 441,
                'SCORE': 0.84615386,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 1626,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 1060,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 1606,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '但是法律规定的申请期限超过六十日的除外。'
              },
              {
                'OUT_SOURCE_START': 1334,
                'OUT_SOURCE_CONTENT': '　　（一）维持具体行政行为的行政复议决定，由作出具体行政行为的行政机关依法强制执行，或者申请人民法院强制执行；',
                'SOURCE_ID': 441,
                'SCORE': 0.76723444,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 1939,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 1389,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 1885,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '　　公民、法人或者其他组织对行政机关的具体行政行为不服申请行政复议的，作出具体行政行为的行政机关是被申请人。'
              },
              {
                'OUT_SOURCE_START': 1334,
                'OUT_SOURCE_CONTENT': '　　（一）维持具体行政行为的行政复议决定，由作出具体行政行为的行政机关依法强制执行，或者申请人民法院强制执行；',
                'SOURCE_ID': 441,
                'SCORE': 0.700386,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 4941,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 1389,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 4874,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '　　行政复议机关责令被申请人重新作出具体行政行为的，被申请人不得以同一的事实和理由作出与原具体行政行为相同或者基本相同的具体行政行为。'
              },
              {
                'OUT_SOURCE_START': 1334,
                'OUT_SOURCE_CONTENT': '　　（一）维持具体行政行为的行政复议决定，由作出具体行政行为的行政机关依法强制执行，或者申请人民法院强制执行；',
                'SOURCE_ID': 441,
                'SCORE': 0.8061496,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 5855,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 1389,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 5807,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '　　（二）变更具体行政行为的行政复议决定，由行政复议机关依法强制执行，或者申请人民法院强制执行。'
              },
              {
                'OUT_SOURCE_START': 1391,
                'OUT_SOURCE_CONTENT': '　　（二）变更具体行政行为的行政复议决定，由行政复议机关依法强制执行，或者申请人民法院强制执行。',
                'SOURCE_ID': 441,
                'SCORE': 0.8061496,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 5805,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 1439,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 5750,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '　　（一）维持具体行政行为的行政复议决定，由作出具体行政行为的行政机关依法强制执行，或者申请人民法院强制执行；'
              },
              {
                'OUT_SOURCE_START': 1706,
                'OUT_SOURCE_CONTENT': '　　第四十三条　本法自1999年10月1日起施行。',
                'SOURCE_ID': 441,
                'SCORE': 0.7126967,
                'SOURCE_FILE': '/home/web/war_back//中华人民共和国行政复议法和国家安全法.txt',
                'OUT_TARGET_END': 78,
                'SCORE_NAME': '词向量模型判定差异性',
                'SOURCE_CHARSET': 'UTF-8',
                'OUT_SOURCE_END': 1731,
                'TARGET_ID': 500345,
                'OUT_TARGET_START': 63,
                'TARGET_CHARSET': 'GBK',
                'TARGET_FILE': '/home/web/Tomcat7/webapps/lawDoc/relatedDocuments/中华人民共和国行政复议法.txt',
                'OUT_TARGET_CONTENT': '自1999年10月1日起施行\n'
              }
            ]
          }
        },
        'msg': 'Success'
      }
      const sourceFile = response.data.item.sourceDocContent
      const checkResult = response.data.item.checkResult
      // 数据处理
      const sourceArray = []
      const targetArray = []
      const sourceSet = new Set()
      const targetSet = new Set()
      checkResult.forEach(d => {
        d.sourceId = `source${d.OUT_SOURCE_START}-${d.OUT_SOURCE_END}`
        d.targetId = `target${d.OUT_TARGET_START}-${d.OUT_TARGET_END}`

        if (!sourceSet.has(d.sourceId)) {
          sourceArray.push(d)
          sourceSet.add(d.sourceId)
        }

        if (!targetSet.has(d.targetId)) {
          targetArray.push(d)
          targetSet.add(d.targetId)
        }
        // this.checkResult.push(d)
      })
      this.sourceResult = sourceArray
      this.targetResult = targetArray

      sourceArray.sort(function(a, b) {
        return a.OUT_SOURCE_START - b.OUT_SOURCE_START
      })
      // 生成公文
      let sourceContent = ''
      let targetContent = ''
      let sourceIndex = 0
      const mainWidth = document.querySelector('.score').offsetWidth
      const containerWidth = document.querySelector('.score-container').offsetWidth
      const jj = mainWidth * 0.04 - 10
      sourceArray.forEach(d => {
        // const sourceId = d.sourceId

        sourceContent += sourceFile.substring(sourceIndex, d.OUT_SOURCE_START)
        targetContent += `<span style="opacity:0;">${sourceFile.substring(sourceIndex, d.OUT_SOURCE_START)}</span>`
        let offsetLeft = 10
        if (/^\s/.test(d.OUT_SOURCE_CONTENT)) {
          offsetLeft = 40
        }
        sourceContent += `<span style="color: rgb(3, 126, 251);position:relative;">${sourceFile.substring(d.OUT_SOURCE_START, d.OUT_SOURCE_END)}<span style="position: absolute;top: -4px;left: ${offsetLeft}px;width: ${containerWidth + jj}px;height: 6px;border: 1px solid rgb(49, 100, 183);border-bottom: none;"></span></span>`
        targetContent += `<span style="color: rgb(3, 126, 251);position:relative;">${sourceFile.substring(d.OUT_SOURCE_START, d.OUT_SOURCE_END)}</span>`
        sourceIndex = d.OUT_SOURCE_END
      })
      sourceContent += sourceFile.slice(sourceIndex)
      targetContent += `<span style="opacity:0;">${sourceFile.slice(sourceIndex)}</span>`
      this.sourceContent = sourceContent
      this.targetContent = targetContent
    }
  }
}
</script>
<style lang="scss" scoped>
    .score {
        padding:30px;
        // height:100%;
        .score-title{
          .score-value{
            color:red;
          }
        }
        .score-container{
            margin-top:10px;
            margin-bottom:30px;
            width: 45%;
            float:left;
            height: calc(100% - 50px);
            white-space: pre-line; 
            font-size: 14px; 
            line-height: 150%;
            padding: 10px 30px 20px;
            // color: gray;
            // overflow: auto;
            color:gray;
            &.first{
               background-color: #fff;
               box-shadow: 0 2px 4px rgba(0, 0, 0, .12), 0 0 6px rgba(0, 0, 0, .04);
               .score-name{
                border-bottom:1px solid #DCDFE6;
               }
            }
            &.last{
                margin-left:4%;
            }
            .score-name{
              height: 30px;
              color:#666;
              text-align: center;
              font-size: 16px;
              letter-spacing: 1px;
              font-weight: 600;
            }
            .score-text{
              margin-top:10px;
            }
        }
    }
</style>